name: "ResNet"
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	include {
		phase: TRAIN
	}
	transform_param {
		mirror: true
		crop_size: 224
		mean_value: 104
		mean_value: 117
		mean_value: 123
	}
	data_param {
		source: "../imagenet/ilsvrc12_train_lmdb"
		batch_size: 8
		backend: LMDB
	}
}
layer {
	name: "data"
	type: "Data"
	top: "data"
	top: "label"
	include {
		phase: TEST
	}
	transform_param {
		mirror: false
		crop_size: 224
		mean_value: 104
		mean_value: 117
		mean_value: 123
	}
	data_param {
		source: "../imagenet/ilsvrc12_val_lmdb"
		batch_size: 5
		backend: LMDB
	}
}

layer {
	bottom: "data"
	top: "conv1"
	name: "conv1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 0
		pad: 7
		stride: 2
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv1"
	top: "conv1"
	name: "bnconv1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv1"
	top: "conv1"
	name: "scaleconv1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv1"
	top: "conv1"
	name: "conv1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv1"
	top: "pool1"
	name: "pool1"
	type: "Pooling"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
	}
}

layer {
	bottom: "pool1"
	top: "conv1_output"
	name: "conv1_output"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "pool1"
	top: "conv2_1_1"
	name: "conv2_1_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_1_1_bn"
	top: "conv2_1_1_bn"
	name: "bnconv2_1_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_1_1_bn"
	top: "conv2_1_1_bn"
	name: "scaleconv2_1_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_1_1_bn"
	top: "conv2_1_1_bn"
	name: "conv2_1_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_1_1_bn"
	top: "conv2_1_2"
	name: "conv2_1_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_1_2_bn"
	top: "conv2_1_2_bn"
	name: "bnconv2_1_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_1_2_bn"
	top: "conv2_1_2_bn"
	name: "scaleconv2_1_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_1_2_bn"
	top: "conv2_1_2_bn"
	name: "conv2_1_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_1_2_bn"
	top: "conv2_1_3"
	name: "conv2_1_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv1_output"
	bottom: "conv2_1_3"
	top: "conv2_1_sum"
	name: "conv2_1_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv2_1_sum_bn"
	top: "conv2_1_sum_bn"
	name: "bnconv2_1_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_1_sum_bn"
	top: "conv2_1_sum_bn"
	name: "scaleconv2_1_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_1_sum_bn"
	top: "conv2_1_sum_bn"
	name: "conv2_1_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_1_sum_bn"
	top: "conv2_2_1"
	name: "conv2_2_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_2_1_bn"
	top: "conv2_2_1_bn"
	name: "bnconv2_2_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_2_1_bn"
	top: "conv2_2_1_bn"
	name: "scaleconv2_2_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_2_1_bn"
	top: "conv2_2_1_bn"
	name: "conv2_2_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_2_1_bn"
	top: "conv2_2_2"
	name: "conv2_2_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_2_2_bn"
	top: "conv2_2_2_bn"
	name: "bnconv2_2_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_2_2_bn"
	top: "conv2_2_2_bn"
	name: "scaleconv2_2_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_2_2_bn"
	top: "conv2_2_2_bn"
	name: "conv2_2_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_2_2_bn"
	top: "conv2_2_3"
	name: "conv2_2_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_1_sum_bn"
	bottom: "conv2_2_3"
	top: "conv2_2_sum"
	name: "conv2_2_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv2_2_sum_bn"
	top: "conv2_2_sum_bn"
	name: "bnconv2_2_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_2_sum_bn"
	top: "conv2_2_sum_bn"
	name: "scaleconv2_2_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_2_sum_bn"
	top: "conv2_2_sum_bn"
	name: "conv2_2_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_2_sum_bn"
	top: "conv2_3_1"
	name: "conv2_3_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_3_1_bn"
	top: "conv2_3_1_bn"
	name: "bnconv2_3_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_3_1_bn"
	top: "conv2_3_1_bn"
	name: "scaleconv2_3_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_3_1_bn"
	top: "conv2_3_1_bn"
	name: "conv2_3_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_3_1_bn"
	top: "conv2_3_2"
	name: "conv2_3_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_3_2_bn"
	top: "conv2_3_2_bn"
	name: "bnconv2_3_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_3_2_bn"
	top: "conv2_3_2_bn"
	name: "scaleconv2_3_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_3_2_bn"
	top: "conv2_3_2_bn"
	name: "conv2_3_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_3_2_bn"
	top: "conv2_3_3"
	name: "conv2_3_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_2_sum_bn"
	bottom: "conv2_3_3"
	top: "conv2_3_sum"
	name: "conv2_3_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv2_3_sum_bn"
	top: "conv2_3_sum_bn"
	name: "bnconv2_3_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv2_3_sum_bn"
	top: "conv2_3_sum_bn"
	name: "scaleconv2_3_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv2_3_sum_bn"
	top: "conv2_3_sum_bn"
	name: "conv2_3_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv2_3_sum_bn"
	top: "conv2_output"
	name: "conv2_output"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 2
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_3_sum_bn"
	top: "conv3_1_1"
	name: "conv3_1_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 2
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_1_1_bn"
	top: "conv3_1_1_bn"
	name: "bnconv3_1_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_1_1_bn"
	top: "conv3_1_1_bn"
	name: "scaleconv3_1_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_1_1_bn"
	top: "conv3_1_1_bn"
	name: "conv3_1_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_1_1_bn"
	top: "conv3_1_2"
	name: "conv3_1_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_1_2_bn"
	top: "conv3_1_2_bn"
	name: "bnconv3_1_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_1_2_bn"
	top: "conv3_1_2_bn"
	name: "scaleconv3_1_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_1_2_bn"
	top: "conv3_1_2_bn"
	name: "conv3_1_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_1_2_bn"
	top: "conv3_1_3"
	name: "conv3_1_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv2_output"
	bottom: "conv3_1_3"
	top: "conv3_1_sum"
	name: "conv3_1_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_1_sum_bn"
	top: "conv3_1_sum_bn"
	name: "bnconv3_1_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_1_sum_bn"
	top: "conv3_1_sum_bn"
	name: "scaleconv3_1_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_1_sum_bn"
	top: "conv3_1_sum_bn"
	name: "conv3_1_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_1_sum_bn"
	top: "conv3_2_1"
	name: "conv3_2_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_2_1_bn"
	top: "conv3_2_1_bn"
	name: "bnconv3_2_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_2_1_bn"
	top: "conv3_2_1_bn"
	name: "scaleconv3_2_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_2_1_bn"
	top: "conv3_2_1_bn"
	name: "conv3_2_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_2_1_bn"
	top: "conv3_2_2"
	name: "conv3_2_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_2_2_bn"
	top: "conv3_2_2_bn"
	name: "bnconv3_2_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_2_2_bn"
	top: "conv3_2_2_bn"
	name: "scaleconv3_2_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_2_2_bn"
	top: "conv3_2_2_bn"
	name: "conv3_2_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_2_2_bn"
	top: "conv3_2_3"
	name: "conv3_2_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_1_sum_bn"
	bottom: "conv3_2_3"
	top: "conv3_2_sum"
	name: "conv3_2_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_2_sum_bn"
	top: "conv3_2_sum_bn"
	name: "bnconv3_2_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_2_sum_bn"
	top: "conv3_2_sum_bn"
	name: "scaleconv3_2_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_2_sum_bn"
	top: "conv3_2_sum_bn"
	name: "conv3_2_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_2_sum_bn"
	top: "conv3_3_1"
	name: "conv3_3_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_3_1_bn"
	top: "conv3_3_1_bn"
	name: "bnconv3_3_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_3_1_bn"
	top: "conv3_3_1_bn"
	name: "scaleconv3_3_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_3_1_bn"
	top: "conv3_3_1_bn"
	name: "conv3_3_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_3_1_bn"
	top: "conv3_3_2"
	name: "conv3_3_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_3_2_bn"
	top: "conv3_3_2_bn"
	name: "bnconv3_3_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_3_2_bn"
	top: "conv3_3_2_bn"
	name: "scaleconv3_3_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_3_2_bn"
	top: "conv3_3_2_bn"
	name: "conv3_3_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_3_2_bn"
	top: "conv3_3_3"
	name: "conv3_3_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_2_sum_bn"
	bottom: "conv3_3_3"
	top: "conv3_3_sum"
	name: "conv3_3_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_3_sum_bn"
	top: "conv3_3_sum_bn"
	name: "bnconv3_3_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_3_sum_bn"
	top: "conv3_3_sum_bn"
	name: "scaleconv3_3_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_3_sum_bn"
	top: "conv3_3_sum_bn"
	name: "conv3_3_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_3_sum_bn"
	top: "conv3_4_1"
	name: "conv3_4_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_4_1_bn"
	top: "conv3_4_1_bn"
	name: "bnconv3_4_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_4_1_bn"
	top: "conv3_4_1_bn"
	name: "scaleconv3_4_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_4_1_bn"
	top: "conv3_4_1_bn"
	name: "conv3_4_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_4_1_bn"
	top: "conv3_4_2"
	name: "conv3_4_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_4_2_bn"
	top: "conv3_4_2_bn"
	name: "bnconv3_4_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_4_2_bn"
	top: "conv3_4_2_bn"
	name: "scaleconv3_4_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_4_2_bn"
	top: "conv3_4_2_bn"
	name: "conv3_4_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_4_2_bn"
	top: "conv3_4_3"
	name: "conv3_4_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_3_sum_bn"
	bottom: "conv3_4_3"
	top: "conv3_4_sum"
	name: "conv3_4_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_4_sum_bn"
	top: "conv3_4_sum_bn"
	name: "bnconv3_4_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_4_sum_bn"
	top: "conv3_4_sum_bn"
	name: "scaleconv3_4_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_4_sum_bn"
	top: "conv3_4_sum_bn"
	name: "conv3_4_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_4_sum_bn"
	top: "conv3_5_1"
	name: "conv3_5_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_5_1_bn"
	top: "conv3_5_1_bn"
	name: "bnconv3_5_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_5_1_bn"
	top: "conv3_5_1_bn"
	name: "scaleconv3_5_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_5_1_bn"
	top: "conv3_5_1_bn"
	name: "conv3_5_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_5_1_bn"
	top: "conv3_5_2"
	name: "conv3_5_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_5_2_bn"
	top: "conv3_5_2_bn"
	name: "bnconv3_5_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_5_2_bn"
	top: "conv3_5_2_bn"
	name: "scaleconv3_5_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_5_2_bn"
	top: "conv3_5_2_bn"
	name: "conv3_5_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_5_2_bn"
	top: "conv3_5_3"
	name: "conv3_5_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_4_sum_bn"
	bottom: "conv3_5_3"
	top: "conv3_5_sum"
	name: "conv3_5_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_5_sum_bn"
	top: "conv3_5_sum_bn"
	name: "bnconv3_5_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_5_sum_bn"
	top: "conv3_5_sum_bn"
	name: "scaleconv3_5_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_5_sum_bn"
	top: "conv3_5_sum_bn"
	name: "conv3_5_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_5_sum_bn"
	top: "conv3_6_1"
	name: "conv3_6_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_6_1_bn"
	top: "conv3_6_1_bn"
	name: "bnconv3_6_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_6_1_bn"
	top: "conv3_6_1_bn"
	name: "scaleconv3_6_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_6_1_bn"
	top: "conv3_6_1_bn"
	name: "conv3_6_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_6_1_bn"
	top: "conv3_6_2"
	name: "conv3_6_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_6_2_bn"
	top: "conv3_6_2_bn"
	name: "bnconv3_6_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_6_2_bn"
	top: "conv3_6_2_bn"
	name: "scaleconv3_6_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_6_2_bn"
	top: "conv3_6_2_bn"
	name: "conv3_6_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_6_2_bn"
	top: "conv3_6_3"
	name: "conv3_6_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_5_sum_bn"
	bottom: "conv3_6_3"
	top: "conv3_6_sum"
	name: "conv3_6_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_6_sum_bn"
	top: "conv3_6_sum_bn"
	name: "bnconv3_6_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_6_sum_bn"
	top: "conv3_6_sum_bn"
	name: "scaleconv3_6_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_6_sum_bn"
	top: "conv3_6_sum_bn"
	name: "conv3_6_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_6_sum_bn"
	top: "conv3_7_1"
	name: "conv3_7_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_7_1_bn"
	top: "conv3_7_1_bn"
	name: "bnconv3_7_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_7_1_bn"
	top: "conv3_7_1_bn"
	name: "scaleconv3_7_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_7_1_bn"
	top: "conv3_7_1_bn"
	name: "conv3_7_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_7_1_bn"
	top: "conv3_7_2"
	name: "conv3_7_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_7_2_bn"
	top: "conv3_7_2_bn"
	name: "bnconv3_7_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_7_2_bn"
	top: "conv3_7_2_bn"
	name: "scaleconv3_7_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_7_2_bn"
	top: "conv3_7_2_bn"
	name: "conv3_7_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_7_2_bn"
	top: "conv3_7_3"
	name: "conv3_7_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_6_sum_bn"
	bottom: "conv3_7_3"
	top: "conv3_7_sum"
	name: "conv3_7_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_7_sum_bn"
	top: "conv3_7_sum_bn"
	name: "bnconv3_7_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_7_sum_bn"
	top: "conv3_7_sum_bn"
	name: "scaleconv3_7_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_7_sum_bn"
	top: "conv3_7_sum_bn"
	name: "conv3_7_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_7_sum_bn"
	top: "conv3_8_1"
	name: "conv3_8_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_8_1_bn"
	top: "conv3_8_1_bn"
	name: "bnconv3_8_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_8_1_bn"
	top: "conv3_8_1_bn"
	name: "scaleconv3_8_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_8_1_bn"
	top: "conv3_8_1_bn"
	name: "conv3_8_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_8_1_bn"
	top: "conv3_8_2"
	name: "conv3_8_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_8_2_bn"
	top: "conv3_8_2_bn"
	name: "bnconv3_8_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_8_2_bn"
	top: "conv3_8_2_bn"
	name: "scaleconv3_8_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_8_2_bn"
	top: "conv3_8_2_bn"
	name: "conv3_8_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_8_2_bn"
	top: "conv3_8_3"
	name: "conv3_8_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 512
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_7_sum_bn"
	bottom: "conv3_8_3"
	top: "conv3_8_sum"
	name: "conv3_8_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv3_8_sum_bn"
	top: "conv3_8_sum_bn"
	name: "bnconv3_8_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv3_8_sum_bn"
	top: "conv3_8_sum_bn"
	name: "scaleconv3_8_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv3_8_sum_bn"
	top: "conv3_8_sum_bn"
	name: "conv3_8_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv3_8_sum_bn"
	top: "conv3_output"
	name: "conv3_output"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 2
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_8_sum_bn"
	top: "conv4_1_1"
	name: "conv4_1_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 2
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_1_1_bn"
	top: "conv4_1_1_bn"
	name: "bnconv4_1_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_1_1_bn"
	top: "conv4_1_1_bn"
	name: "scaleconv4_1_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_1_1_bn"
	top: "conv4_1_1_bn"
	name: "conv4_1_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_1_1_bn"
	top: "conv4_1_2"
	name: "conv4_1_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_1_2_bn"
	top: "conv4_1_2_bn"
	name: "bnconv4_1_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_1_2_bn"
	top: "conv4_1_2_bn"
	name: "scaleconv4_1_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_1_2_bn"
	top: "conv4_1_2_bn"
	name: "conv4_1_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_1_2_bn"
	top: "conv4_1_3"
	name: "conv4_1_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv3_output"
	bottom: "conv4_1_3"
	top: "conv4_1_sum"
	name: "conv4_1_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_1_sum_bn"
	top: "conv4_1_sum_bn"
	name: "bnconv4_1_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_1_sum_bn"
	top: "conv4_1_sum_bn"
	name: "scaleconv4_1_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_1_sum_bn"
	top: "conv4_1_sum_bn"
	name: "conv4_1_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_1_sum_bn"
	top: "conv4_2_1"
	name: "conv4_2_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_2_1_bn"
	top: "conv4_2_1_bn"
	name: "bnconv4_2_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_2_1_bn"
	top: "conv4_2_1_bn"
	name: "scaleconv4_2_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_2_1_bn"
	top: "conv4_2_1_bn"
	name: "conv4_2_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_2_1_bn"
	top: "conv4_2_2"
	name: "conv4_2_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_2_2_bn"
	top: "conv4_2_2_bn"
	name: "bnconv4_2_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_2_2_bn"
	top: "conv4_2_2_bn"
	name: "scaleconv4_2_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_2_2_bn"
	top: "conv4_2_2_bn"
	name: "conv4_2_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_2_2_bn"
	top: "conv4_2_3"
	name: "conv4_2_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_1_sum_bn"
	bottom: "conv4_2_3"
	top: "conv4_2_sum"
	name: "conv4_2_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_2_sum_bn"
	top: "conv4_2_sum_bn"
	name: "bnconv4_2_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_2_sum_bn"
	top: "conv4_2_sum_bn"
	name: "scaleconv4_2_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_2_sum_bn"
	top: "conv4_2_sum_bn"
	name: "conv4_2_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_2_sum_bn"
	top: "conv4_3_1"
	name: "conv4_3_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_3_1_bn"
	top: "conv4_3_1_bn"
	name: "bnconv4_3_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_3_1_bn"
	top: "conv4_3_1_bn"
	name: "scaleconv4_3_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_3_1_bn"
	top: "conv4_3_1_bn"
	name: "conv4_3_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_3_1_bn"
	top: "conv4_3_2"
	name: "conv4_3_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_3_2_bn"
	top: "conv4_3_2_bn"
	name: "bnconv4_3_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_3_2_bn"
	top: "conv4_3_2_bn"
	name: "scaleconv4_3_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_3_2_bn"
	top: "conv4_3_2_bn"
	name: "conv4_3_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_3_2_bn"
	top: "conv4_3_3"
	name: "conv4_3_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_2_sum_bn"
	bottom: "conv4_3_3"
	top: "conv4_3_sum"
	name: "conv4_3_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_3_sum_bn"
	top: "conv4_3_sum_bn"
	name: "bnconv4_3_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_3_sum_bn"
	top: "conv4_3_sum_bn"
	name: "scaleconv4_3_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_3_sum_bn"
	top: "conv4_3_sum_bn"
	name: "conv4_3_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_3_sum_bn"
	top: "conv4_4_1"
	name: "conv4_4_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_4_1_bn"
	top: "conv4_4_1_bn"
	name: "bnconv4_4_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_4_1_bn"
	top: "conv4_4_1_bn"
	name: "scaleconv4_4_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_4_1_bn"
	top: "conv4_4_1_bn"
	name: "conv4_4_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_4_1_bn"
	top: "conv4_4_2"
	name: "conv4_4_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_4_2_bn"
	top: "conv4_4_2_bn"
	name: "bnconv4_4_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_4_2_bn"
	top: "conv4_4_2_bn"
	name: "scaleconv4_4_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_4_2_bn"
	top: "conv4_4_2_bn"
	name: "conv4_4_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_4_2_bn"
	top: "conv4_4_3"
	name: "conv4_4_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_3_sum_bn"
	bottom: "conv4_4_3"
	top: "conv4_4_sum"
	name: "conv4_4_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_4_sum_bn"
	top: "conv4_4_sum_bn"
	name: "bnconv4_4_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_4_sum_bn"
	top: "conv4_4_sum_bn"
	name: "scaleconv4_4_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_4_sum_bn"
	top: "conv4_4_sum_bn"
	name: "conv4_4_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_4_sum_bn"
	top: "conv4_5_1"
	name: "conv4_5_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_5_1_bn"
	top: "conv4_5_1_bn"
	name: "bnconv4_5_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_5_1_bn"
	top: "conv4_5_1_bn"
	name: "scaleconv4_5_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_5_1_bn"
	top: "conv4_5_1_bn"
	name: "conv4_5_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_5_1_bn"
	top: "conv4_5_2"
	name: "conv4_5_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_5_2_bn"
	top: "conv4_5_2_bn"
	name: "bnconv4_5_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_5_2_bn"
	top: "conv4_5_2_bn"
	name: "scaleconv4_5_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_5_2_bn"
	top: "conv4_5_2_bn"
	name: "conv4_5_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_5_2_bn"
	top: "conv4_5_3"
	name: "conv4_5_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_4_sum_bn"
	bottom: "conv4_5_3"
	top: "conv4_5_sum"
	name: "conv4_5_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_5_sum_bn"
	top: "conv4_5_sum_bn"
	name: "bnconv4_5_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_5_sum_bn"
	top: "conv4_5_sum_bn"
	name: "scaleconv4_5_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_5_sum_bn"
	top: "conv4_5_sum_bn"
	name: "conv4_5_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_5_sum_bn"
	top: "conv4_6_1"
	name: "conv4_6_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_6_1_bn"
	top: "conv4_6_1_bn"
	name: "bnconv4_6_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_6_1_bn"
	top: "conv4_6_1_bn"
	name: "scaleconv4_6_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_6_1_bn"
	top: "conv4_6_1_bn"
	name: "conv4_6_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_6_1_bn"
	top: "conv4_6_2"
	name: "conv4_6_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_6_2_bn"
	top: "conv4_6_2_bn"
	name: "bnconv4_6_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_6_2_bn"
	top: "conv4_6_2_bn"
	name: "scaleconv4_6_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_6_2_bn"
	top: "conv4_6_2_bn"
	name: "conv4_6_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_6_2_bn"
	top: "conv4_6_3"
	name: "conv4_6_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_5_sum_bn"
	bottom: "conv4_6_3"
	top: "conv4_6_sum"
	name: "conv4_6_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_6_sum_bn"
	top: "conv4_6_sum_bn"
	name: "bnconv4_6_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_6_sum_bn"
	top: "conv4_6_sum_bn"
	name: "scaleconv4_6_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_6_sum_bn"
	top: "conv4_6_sum_bn"
	name: "conv4_6_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_6_sum_bn"
	top: "conv4_7_1"
	name: "conv4_7_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_7_1_bn"
	top: "conv4_7_1_bn"
	name: "bnconv4_7_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_7_1_bn"
	top: "conv4_7_1_bn"
	name: "scaleconv4_7_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_7_1_bn"
	top: "conv4_7_1_bn"
	name: "conv4_7_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_7_1_bn"
	top: "conv4_7_2"
	name: "conv4_7_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_7_2_bn"
	top: "conv4_7_2_bn"
	name: "bnconv4_7_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_7_2_bn"
	top: "conv4_7_2_bn"
	name: "scaleconv4_7_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_7_2_bn"
	top: "conv4_7_2_bn"
	name: "conv4_7_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_7_2_bn"
	top: "conv4_7_3"
	name: "conv4_7_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_6_sum_bn"
	bottom: "conv4_7_3"
	top: "conv4_7_sum"
	name: "conv4_7_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_7_sum_bn"
	top: "conv4_7_sum_bn"
	name: "bnconv4_7_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_7_sum_bn"
	top: "conv4_7_sum_bn"
	name: "scaleconv4_7_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_7_sum_bn"
	top: "conv4_7_sum_bn"
	name: "conv4_7_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_7_sum_bn"
	top: "conv4_8_1"
	name: "conv4_8_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_8_1_bn"
	top: "conv4_8_1_bn"
	name: "bnconv4_8_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_8_1_bn"
	top: "conv4_8_1_bn"
	name: "scaleconv4_8_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_8_1_bn"
	top: "conv4_8_1_bn"
	name: "conv4_8_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_8_1_bn"
	top: "conv4_8_2"
	name: "conv4_8_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_8_2_bn"
	top: "conv4_8_2_bn"
	name: "bnconv4_8_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_8_2_bn"
	top: "conv4_8_2_bn"
	name: "scaleconv4_8_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_8_2_bn"
	top: "conv4_8_2_bn"
	name: "conv4_8_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_8_2_bn"
	top: "conv4_8_3"
	name: "conv4_8_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_7_sum_bn"
	bottom: "conv4_8_3"
	top: "conv4_8_sum"
	name: "conv4_8_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_8_sum_bn"
	top: "conv4_8_sum_bn"
	name: "bnconv4_8_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_8_sum_bn"
	top: "conv4_8_sum_bn"
	name: "scaleconv4_8_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_8_sum_bn"
	top: "conv4_8_sum_bn"
	name: "conv4_8_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_8_sum_bn"
	top: "conv4_9_1"
	name: "conv4_9_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_9_1_bn"
	top: "conv4_9_1_bn"
	name: "bnconv4_9_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_9_1_bn"
	top: "conv4_9_1_bn"
	name: "scaleconv4_9_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_9_1_bn"
	top: "conv4_9_1_bn"
	name: "conv4_9_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_9_1_bn"
	top: "conv4_9_2"
	name: "conv4_9_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_9_2_bn"
	top: "conv4_9_2_bn"
	name: "bnconv4_9_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_9_2_bn"
	top: "conv4_9_2_bn"
	name: "scaleconv4_9_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_9_2_bn"
	top: "conv4_9_2_bn"
	name: "conv4_9_2_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_9_2_bn"
	top: "conv4_9_3"
	name: "conv4_9_3"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 1024
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_8_sum_bn"
	bottom: "conv4_9_3"
	top: "conv4_9_sum"
	name: "conv4_9_sum"
	type: "Eltwise"
	eltwise_param {
		operation: SUM
	}
}

layer {
	bottom: "conv4_9_sum_bn"
	top: "conv4_9_sum_bn"
	name: "bnconv4_9_sum_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_9_sum_bn"
	top: "conv4_9_sum_bn"
	name: "scaleconv4_9_sum_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_9_sum_bn"
	top: "conv4_9_sum_bn"
	name: "conv4_9_sum_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_9_sum_bn"
	top: "conv4_10_1"
	name: "conv4_10_1"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 0
		pad: 1
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_10_1_bn"
	top: "conv4_10_1_bn"
	name: "bnconv4_10_1_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_10_1_bn"
	top: "conv4_10_1_bn"
	name: "scaleconv4_10_1_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_10_1_bn"
	top: "conv4_10_1_bn"
	name: "conv4_10_1_relu"
	type: "ReLU"
}

layer {
	bottom: "conv4_10_1_bn"
	top: "conv4_10_2"
	name: "conv4_10_2"
	type: "Convolution"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 3
		stride: 1
		weight_filler {
			type: "msra"
		}
		bias_term: false
	}
}

layer {
	bottom: "conv4_10_2_bn"
	top: "conv4_10_2_bn"
	name: "bnconv4_10_2_bn"
	type: "BatchNorm"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}

layer {
	bottom: "conv4_10_2_bn"
	top: "conv4_10_2_bn"
	name: "scaleconv4_10_2_bn"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
	bottom: "conv4_10_2_bn"
	top: "conv4_10_2_bn"
	name: "conv4_10_2_relu"
